"""
@author:sourabh
"""

"""
These are different forms(sequence of suffixes) to which any noun word belongs to depending on its gender and ending character.

"""
a_stem_m=[['अः','औ','आः'],
              ['अम्','औ','आन्'],
              ['एन','आभ्याम्','ऐः'],
              ['आय','आभ्याम्','एभ्यः'],
              ['आत्','आभ्याम्','एभ्यः'],
              ['अस्य','अयोः','आनाम्'],
              ['ए','अयोः','एषु'],
              ['अ','औ','आः']]
        
i_stem_m=[['इः','ई','अयः'],
              ['इम्','ई','ईन्'],
              ['इना','इभ्याम्','इभिः'],
              ['अये','इभ्याम्','इभ्यः'],
              ['एः','इभ्याम्','इभ्यः'],
              ['एः','योः','ईनाम्'],
              ['औ','योः','इषु'],
              ['ए','ई','अयः']]
              
u_stem_m=[['उः','ऊ','अवः'],
              ['उम्','ऊ','ऊन्'],
              ['उना','उभ्याम्','उभिः'],
              ['अवे','उभ्याम्','उभ्यः'],
              ['ओः','उभ्याम्','उभ्यः'],
              ['ओः','वोः','ऊनाम्'],
              ['औ','वोः','उषु'],
              ['ओ','ऊ','अवः']]
             
r_stem_m_1=[['आ','अरौ','अरः'],
                  ['अरम्','अरौ','ऋन्'],
                  ['रा','ऋभ्याम्','ऋभिः'],
                  ['रे','ऋभ्याम्','ऋभ्यः'],
                  ['उः','ऋभ्याम्','ऋभ्यः'],
                  ['उः','रोः','ऋणाम्'],
                  ['अरि','रोः','ऋषु'],
                  ['अः','अरौ','अरः']]
                  
r_stem_m_2=[['आ','अारौ','अारः'],
                  ['अारम्','अारौ','ऋन्'],
                  ['रा','ऋभ्याम्','ऋभिः'],
                  ['रे','ऋभ्याम्','ऋभ्यः'],
                  ['उः','ऋभ्याम्','ऋभ्यः'],
                  ['उः','रोः','ऋणाम्'],
                  ['अरि','रोः','ऋषु'],
                  ['अः','अरौ','अरः']]
                
o_stem_m=[['औः','आवौ','आवः'],
          ['आम्','आवौ','आः'],
          ['अवा','ओभ्याम्','ओभिः'],
          ['अवे','ओभ्याम्','ओभ्यः'],
          ['ओः','ओभ्याम्','ओभ्यः'],
          ['ओः','अवोः','अवाम्'],
          ['अवि','अवोः','ओषु'],
          ['औः', 'आवौ' ,'आवः']]

t_stem_m_1=[['आन्','न्तौ','न्तः'],
                    ['न्तम्','न्तौ','तः'],
                    ['ता','द्भ्याम्','द्भिः'],
                    ['ते','द्भ्याम्','द्भ्यः'],
                    ['तः','द्भ्याम्','द्भ्यः'],
                    ['तः','तोः','ताम्'],
                    ['ति','तोः','त्सु'],
                    ['न्','न्तौ','न्तः']]
                    
t_stem_m_2=[['न्','न्तौ','न्तः'],
                    ['न्तम्','न्तौ','तः'],
                    ['ता','द्भ्याम्','द्भिः'],
                    ['ते','द्भ्याम्','द्भ्यः'],
                    ['तः','द्भ्याम्','द्भ्यः'],
                    ['तः','तोः','ताम्'],
                    ['ति','तोः','त्सु'],
                    ['न्','न्तौ','न्तः']]
                    
t_stem_m_3=[['त्','तौ','तः'],
                    ['तम्','तौ','तः'],
                    ['ता','द्भ्याम्','द्भिः'],
                    ['ते','द्भ्याम्','द्भ्यः'],
                    ['तः','द्भ्याम्','द्भ्यः'],
                    ['तः','तोः','ताम्'],
                    ['ति','तोः','त्सु'],
                    ['त्','तौ','तः']]
c_stem_m=[['अक्','अचौ','अचः'],
                  ['अचम्','अचौ','अचः'],
                  ['अचा','अग्भ्याम्','अग्भिः'],
                  ['अचे','अग्भ्याम्','अग्भः'],
                  ['अचः','अग्भ्याम्','अग्भः'],
                  ['अचः','अचोः','अचाम्'],
                  ['अच्','अचोः','अक्षु'],
                  ['अक्','अचौ','अचः']]   
                 
j_stem_m=[['क्','जौ','जः'],
                  ['जम्','जौ','जः'],
                  ['जा','ग्भ्याम्','ग्भिः'],
                  ['जे','ग्भ्याम्','ग्भः'],
                  ['जः','ग्भ्याम्','ग्भः'],
                  ['जः','जोः','जाम्'],
                  ['जि','जोः','क्षु'],
                  ['क्','जौ','जः']]



en_stem_m=[['ई','इनौ','इनः'],
                   ['इनम्','इनौ','इनः'],
                   ['इना','इभ्याम्','इभिः'],
                   ['इने','इभ्याम्','इभ्यः'],
                   ['इनः','इभ्याम्','इभ्यः'],
                   ['इनः','इनोः','इनाम्'],
                   ['इनि','इनोः','इषु'],
                   ['इन्','इनौ','इनः']]

an_stem_m_1=[['आ','आनौ','आनः'],
                    ['आनम्','आनौ','नः'], 
                    ['ना','अभ्याम्','अभिः'],
                    ['ने','अभ्याम्','अभ्यः'],
                    ['नः','अभ्याम्','अभ्यः'],
                    ['नः','नोः','नाम्'],
                    ['नि','नोः','असु'],
                    ['अन्','आनौ','अानः']]

an_stem_m_2=[['आ','आनौ','आनः'],
                    ['आनम्','आनौ','अनः'],
                    ['अना','अभ्याम्','अभिः'],
                    ['अने','अभ्याम्','अभ्यः'],
                    ['अनः','अभ्याम्','अभ्यः'],
                    ['अनः','अनोः','अनाम्'],
                    ['अनि','अनोः','असु'],
                    ['अन्','आनौ','अानः']]
                 
a_stem_f=[['आ','ए','आः'],
                 ['आम्','ए','आः'],
                 ['अया','आभ्याम्','आभिः'],
                 ['आयै','आभ्याम्','आभ्यः'],
                 ['आयाः','आभ्याम्','आभ्यः'],
                 ['आयाः','अयोः','आनाम्'],
                 ['आयाम्','अयोः','आसु'],
                 ['ए','ए', 'आः']]
                 
i_stem_f=[['इः','ई','अयः'],
                ['इम्','ई','ईः'],
                ['या','इभ्याम्','इभिः'],
                ['यै','इभ्याम्','इभ्यः'],
                ['याः','इभ्याम्','इभ्यः'],
                ['याः','योः','ईनाम्'],
                ['याम्','योः','इषु'],
                ['ए','ई','अयः']]
                
ii_stem_f=[['ई','यौ','यः'],
                 ['ईम्','यौ','ईः'],
                 ['या', 'ईभ्याम्','ईभिः'],
                 ['यै','ईभ्याम्','ईभ्यः'],
                 ['याः','ईभ्याम्','ईभ्यः'],
                 ['याः','योः','ईनाम्'],
                 ['याम्','योः','ईषु'],
                 ['इ','यौ','यः']]

u_stem_f=[['उः','ऊ','अवः'],
                 ['उम्','ऊ','ऊः'],
                 ['वा','उभ्याम्','उभिः'],
                 ['वै','उभ्याम्','उभ्यः'],
                 ['वाः','उभ्याम्','उभ्यः'],
                 ['वाः','वोः','ऊनाम्'],
                 ['वाम्','वोः','उषु'],
                 ['ओ','ऊ','अवः']]
                 
uu_stem_f=[['ऊः','वौ','वः'],
                  ['ऊम्','वौ','ऊः'],
                  ['वा','ऊभ्याम्','ऊभिः'],
                  ['वै','ऊभ्याम्','ऊभ्यः'],
                  ['वाः','ऊभ्याम्','ऊभ्यः'],
                  ['वाः','वोः','ऊनाम्'],
                  ['वाम्','वोः','ऊषु'],
                  ['उ','वौ','वः']]
                  
r_stem_f=[['आ','अरौ','अरः'],
                 ['अरम्','अरौ','ऋः'],
                 ['रा','ऋभ्याम्','ऋभिः'],
                 ['रे','ऋभ्याम्','ऋभ्यः'],
                 ['उः','ऋभ्याम्','ऋभ्यः'],
                 ['उः','रोः','ऋणाम्'],
                 ['अरि','रोः','ऋषु'],
                 ['अः','अरौ','अरः']]
                 
oo_stem_f=[['औः','आवौ','आवः'],
                  ['आवम्','आवौ','आवः'],
                  ['आवा','औभ्याम्','औभिः'],
                  ['आवे','औभ्याम्','औभ्यः'],
                  ['आवः','औभ्याम्','औभ्यः'],
                  ['आवः','आवोः','आवाम्'],
                  ['आवि','आवोः','औषु'],
                  ['औः','आवौ','आवः']]  
                  
c_stem_f=[['क्','चौ','चः'],
                 ['चम्','चौ','चः'],
                 ['चा','ग्भ्याम्','ग्भिः'],
                 ['चे','ग्भ्याम्','ग्भ्यः'],
                 ['चः','ग्भ्याम्','ग्भ्यः'],
                 ['चः','चोः','चाम्'],
                 ['चि','चोः','क्षु'],
                 ['क्','चौ','चः']]
                 
t_stem_f=[['त्','तौ','तः'],
                 ['तम्','तौ','तः'],
                 ['ता','दभ्याम्','द्भिः'],
                 ['ते','दभ्याम्','द्भ्यः'],
                 ['तः','दभ्याम्','द्भ्यः'],
                 ['तः','तोः','ताम्'],
                 ['ति','तोः','त्सु'],
                 ['त्','तौ','तः']]
                 
sh_stem_f=[['क्','शौ','शः'],
           ['शम्','शौ','शः'],
           ['शा','ग्भ्याम्','ग्भिः'],
           ['शे','ग्भ्याम्','ग्भ्यः'],
           ['शः','ग्भ्याम्','ग्भ्यः'],
           ['शः','शोः','शाम्'],
           ['शि','शोः','क्षु'],
           ['अक्','शौ','शः']]
                 
h_stem_f=[['त्','हौ','हः'],
                 ['हम्','हौ','हः'],
                 ['हा','द्भ्याम्','द्भिः'],
                 ['हे','द्भ्याम्','द्भ्यः'],
                 ['हः','द्भ्याम्','द्भ्यः'],
                 ['हः','होः','हाम्'],
                 ['हि','होः','त्सु'],
                 ['त्','हौ','हः']]
           
dh_stem_f=[['त्','धौ','धः'],
                 ['धम्','धौ','धः'],
                 ['धा','द्भ्याम्','द्भिः'],
                 ['धे','द्भ्याम्','द्भ्यः'],
                 ['धः','द्भ्याम्','द्भ्यः'],
                 ['धः','धोः','धाम्'],
                 ['धि','धोः','त्सु'],
                 ['त्','धौ','धः']]
                 
d_stem_f=[['त्','दौ','दः'],
                 ['दम्','दौ','दः'],
                 ['दा','द्भ्याम्','द्भिः'],
                 ['दे','द्भ्याम्','द्भ्यः'],
                 ['दः','द्भ्याम्','द्भ्यः'],
                 ['दः','दोः','दाम्'],
                 ['दि','दोः','त्सु'],
                 ['त्','दौ','दः']]
                 
a_stem_n=[['अम्','ए','आनि'],
                ['अम्','ए','आनि'],
                ['एन','आभ्याम्','ऐः'],
                ['आय','आभ्याम्','एभ्यः'],
                ['आत्','आभ्याम्','एभ्यः'],
                ['अस्य','अयोः','आनाम्'],
                ['ए','अयोः','एषु'],
                ['अ','औ','आः']]
                
i_stem_n_1=[['इ','इनी','ईनि'],
                 ['इ','इनी','ईनि'],
                 ['इना','इभ्याम्','इभिः'],
                 ['इने','इभ्याम्','इभ्यः'],
                 ['इनः','इभ्याम्','इभ्यः'],
                 ['इनः','इनोः','ईनाम्'],
                 ['इनि','इनोः','इषु'],
                 ['इ',',इनी','ईनि']]
                 
i_stem_n_2=[['इ','इनी','ईनि'],
                 ['इ','इनी','ईनि'],
                 ['ना','इभ्याम्','इभिः'],
                 ['ने','इभ्याम्','इभ्यः'],
                 ['नः','इभ्याम्','इभ्यः'],
                 ['नः','नोः','नाम्'],
                 ['नि','नोः','इषु'],
                 ['इ','इनी','ईनि']]
                 
u_stem_n=[['उ','उनी','ऊनि'],
               ['उ','उनी','ऊनि'],
               ['उना','उभ्याम्','उभिः'],
               ['उने','उभ्याम्','उभ्यः'],
               ['उनः','उभ्याम्','उभ्यः'],
               ['उनः','उनोः','ऊनाम्'],
               ['उनि','उनोः','उषु'],
               ['उ','उनी','ऊनि']]

r_stem_n=[['ऋ', 'ऋणी','ऋृणि'],
          ['ऋ', 'ऋणी','ऋृणि'],
          ['ऋणा','ऋभ्याम्', 'ऋभिः'],
          ['ऋणे', 'ऋभ्याम्', 'ऋभ्यः'],
          ['ऋणः', 'ऋभ्याम्', 'ऋभ्यः'],
          ['ऋणः', 'ऋणोः','ऋणाम्'],
          ['ऋणि','ऋणोः','ऋषु'],
          ['ऋ', 'ऋणी','ऋृणि']]
as_stem_n=[['अः','असी','आंसि'],
               ['अः','असी','आंसि'],
               ['असा','ओभ्याम्','ओभिः'],
               ['असे','ओभ्याम्','ओभ्यः'],
               ['असः','ओभ्याम्','ओभ्यः'],
               ['असः','असोः','असाम्'],
               ['असि','असोः','अःसु'],
               ['अः','असी','आंसि']]
               
an_stem_n=[['अ','अनी','आनि'],
               ['अ','अनी','आनि'],
               ['ना','अभ्याम्','अभिः'],
               ['ने','अभ्याम्','अभ्यः'],
               ['नः','अभ्याम्','अभ्यः'],
               ['नः','नोः','नाम्'],
               ['नि','नोः','असु'],
               ['अ','अनी','आनि']]
               
t_stem_n=[['त्','ती','न्ति'],
               ['ति','ती','न्ति'],
               ['ता','द्भ्याम्','द्भिः'],
               ['ते','द्भ्याम्','द्भ्यः'],
               ['तः','द्भ्याम्','द्भ्यः'],
               ['तः','तोः','ताम्'],
               ['ति','तोः','त्सु'],
               ['त्','ती','न्ति']]
               
               
''' These are some unique words , whose declension are different from rest of the words of their type'''

सम्राज्=[['सम्राट्','सम्राजौ','सन्राजः'],
      ['सम्राजम्','सम्राजौ','सम्राजः'],
      ['सम्राजा','सम्राड्भ्याम्','सम्राड्भिः'],
      ['सम्राजे','सम्राड्भ्याम्','सम्राड्भ्यः'],
      ['सम्राजः','सम्राड्भ्याम्','सम्राड्भ्यः'],
      ['सम्राजः','सम्राजोः','सम्राजाम्'],
      ['सम्राजि','सम्राजोः','सम्राट्सु'],
      ['सम्राट्','सम्राजौ','सम्राजः']]
      
पथिन्=[['पन्थाः','पन्थानौ','पन्थानः'],
       ['पन्थानम्','पन्थानौ','पथः'],
       ['पथा','पथिभ्याम्','पथिभिः'],
       ['पथे','पथिभ्याम्','पथिभ्यः'],
       ['पथः','पथिभ्याम्','पथिभ्यः'],
       ['पथः','पथोः','पथाम्'],
       ['पथि','पथोः','पथिषु'],
       ['पन्थाः','पन्थानौ','पन्थानः']]
       
विद्वस्=[['विद्वान्','विद्वांसौ','विद्वासः'],
         ['विद्वासम्','विद्वांसौ','विदुषः'],
         ['विदुषा','विद्वद्भ्याम्','विद्वद्भिः'],
         ['विदुषे','विद्वद्भ्याम्','विद्वद्भ्यः'],
         ['विदुषः','विद्वद्भ्याम्','विद्वद्भ्यः'],
         ['विदुषः','विदुषोः','विदुषाम्'],
         ['विदुषि','विदुषोः','विद्वत्सु'],
         ['विद्वन्','विद्वांसौ','विद्वासः']]
         
स्त्री=[['स्त्री','स्त्रियौ','स्त्रियः'],
    ['स्त्रियम्','स्त्रियौ','स्त्रियः'],
    ['स्त्रिया','स्त्रीभ्याम्','स्त्रीभिः'],
    ['स्त्रियै','स्त्रीभ्याम्','स्त्रीभ्यः'],
    ['स्त्रियाः','स्त्रीभ्याम्','स्त्रीभ्यः'],
    ['स्त्रियाः','स्त्रियोः','स्त्रीणाम्'],
    ['स्त्रियाम्','स्त्रियोः','स्त्रीषु'],
    ['स्त्री','स्त्रियौ','स्त्रियः']]
              
all_D_forms=[a_stem_m,i_stem_m,u_stem_m,r_stem_m_1,r_stem_m_2,o_stem_m,
          a_stem_f,i_stem_f,ii_stem_f,u_stem_f,uu_stem_f,r_stem_f,oo_stem_f,
          t_stem_f,c_stem_f,h_stem_f,dh_stem_f,d_stem_f,sh_stem_f,a_stem_n,
          i_stem_n_1,i_stem_n_2,u_stem_n,en_stem_m,t_stem_m_1,t_stem_m_2,t_stem_m_3,
          an_stem_m_1,an_stem_m_2,c_stem_m,j_stem_m,
          t_stem_n,as_stem_n,an_stem_n]
dict_forms={0:'a_stem_m',
           1:'i_stem_m',
           2:'u_stem_m',
           3:'r_stem_m_1',
           4:'r_stem_m_2',
           5:'o_stem_m',
           6:'a_stem_f',
           7:'i_stem_f',
           8:'ii_stem_f',
           9:'u_stem_f',
           10:'uu_stem_f',
           11:'r_stem_f',
           12:'oo_stem_f',
           13:'a_stem_n',
           14:'i_stem_n_1',
           15:'i_stem_n_2',
           16:'u_stem_n',
           17:'en_stem_m',
           18:'t_stem_m_1',
           19:'t_stem_m_2',
           20:'t_stem_m_3',
           21:'n_stem_m_1',
           22:'n_stem_m_2',
           23:'c_stem_m',
           24:'j_stem_m',
           25:'t_stem_f',
           26:'c_stem_f',
           27:'h_stem_f',
           28:'dh_stem_f',
           29:'d_stem_f',
           30:'sh_stem_f',
           31:'t_stem_n',
           32:'s_stem_n',
           33:'n_stem_n',
           34:'r_stem_n'}
