"""
@author: sourabh
"""

''' These are some declension to pronoun words'''
from words_tagging import *
                 
तद्_masculine=[['सः','तौ','ते'],
          ['तम्','तौ','तान्'],
          ['तेन','ताभ्याम्','तैः'],
          ['तस्मै','ताभ्याम्','तेभ्यः'],
          ['तस्मात्','ताभ्याम्','तेभ्यः'],
          ['तस्य','तयोः','तेषाम्'],
          ['तस्मिन्','तयोः','तेषु']]
तद्_feminine=[['सा','ते','ताः'],
            ['ताम्','ते','ताः'],
            ['तया','ताभ्याम्','ताभिः'],
            ['तस्यै','ताभ्याम्','ताभ्यः'],
            ['तस्याः','ताभ्याम्','ताभ्यः'],
            ['तस्याः','तयोः','तासाम्'],
            ['तस्याम्','तयोः','तासु']]
तद्_neuter=[['तत्','ते','तानि'],
            ['तत्','ते','तानि'],
            ['तेन','ताभ्याम्','तैः'],
            ['तस्मै','ताभ्याम्','तेभ्यः'],
            ['तस्मात्','ताभ्याम्','तेभ्यः'],
            ['तस्य','तयोः','तेषाम्'],
            ['तस्मिन्','तयोः','तेषु']]
            
एतद्_masculine=[['एषः','एतौ','एते'],
          ['एतम्','एतौ','एतान्'],
          ['एतेन','एताभ्याम्','एतैः'],
          ['एतस्मै','एताभ्याम्','एतेभ्यः'],
          ['एतस्मात्','एताभ्याम्','एतेभ्यः'],
          ['एतस्य','एतयोः','एतेषाम्'],
          ['एतस्मिन्','एतयोः','एतेषु']]
          
एतद्_feminine=[['एषा','एते','एताः'],
            ['एताम्','एते','एताः'],
            ['एतया','एताभ्याम्','एताभिः'],
            ['एतस्यै','एताभ्याम्','एताभ्यः'],
            ['एतस्याः','एताभ्याम्','एताभ्यः'],
            ['एतस्याः','एतयोः','एतासाम्'],
            ['एतस्याम्','एतयोः','एतासु']]
            
एतद्_neuter=[['एतत्','एते','एतानि'],
            ['एतत्','एते','एतानि'],
            ['एतेन','एताभ्याम्','एतैः'],
            ['एतस्मै','एताभ्याम्','एतेभ्यः'],
            ['एतस्मात्','एताभ्याम्','एतेभ्यः'],
            ['एतस्य','एतयोः','एतेषाम्'],
            ['एतस्मिन्','एतयोः','एतेषु']]
            

            
अस्मद्=[['अहम्','आवाम्','वयम्'],
       ['माम्','आवाम्','अस्मान्'],
       ['मया','आवाभ्याम्','अस्माभिः'],
       ['मह्यम्','आवाभ्याम्','अस्मभ्यम्'],
       ['मत्','आवाभ्याम्','अस्मत्'],
       ['मम','आवयोः','अस्माकम्'],
       ['मयि','आवयोः','अष्मासु']]
       
युष्मद्=[['त्वम्','युवाम्','यूयम्'],
         ['त्वाम्','युवाम्','युष्मान्'],
         ['त्वया','युवाभ्याम्','युष्माभिः'],
         ['तुभ्यम्','युवाभ्याम्','युष्मभ्य'],
         ['त्वत्','युवाभ्याम्','युष्मत्'],
         ['तव','युवयोः','युष्माकम्'],
         ['त्वयि','युवयोः','युष्मासु']]
  
किम्_masculine=[['कः','कौ','के'],
          ['कम्','कौ','कान्'],
          ['केन','काभ्याम्','कैः'],
          ['कस्मै','काभ्याम्','केभ्यः'],
          ['कस्मात्','काभ्याम्','केभ्यः'],
          ['कस्य','कयोः','केषाम्'],
          ['कस्मिन्','कयोः','केषु']]
          
किम्_feminine=[['का','केे','काः'],
            ['काम्','के','काः'],
            ['कया','काभ्याम्','काभिः'],
            ['कस्यै','काभ्याम्','काभ्यः'],
            ['कस्याः','काभ्याम्','काभ्यः'],
            ['कस्याः','कयोः','कासाम्'],
            ['कस्याम्','कयोः','कासु']]
            
किम्_neuter=[['किम्','के','कानि'],
            ['किम्','के','कानि'],
            ['केन','काभ्याम्','कैः'],
            ['कस्मै','काभ्याम्','केभ्यः'],
            ['कस्मात्','काभ्याम्','केभ्यः'],
            ['कस्य','कयोः','केषाम्'],
            ['कस्मिन्','कयोः','केषु']]

इदम्_masculine=[['अयम्','इमौ','इमे'],
           ['इमम्','इमौ','इमान्'],
           ['अनेन','आभ्याम्','एभिः'],
           ['अस्मै','आभ्याम्','एभ्यः'],
           ['अस्मात्','आभ्याम्','एभ्यः'],
           ['अस्य','अनयोः','एषाम्'],
           ['अस्मिन्','अनयोः','एषु']]
           
इदम्_feminine=[['इयम्','इमे','इमाः'],
             ['इमम्','इमे','इमाः'],
             ['अनया','आभ्याम्','आभिः'],
             ['अस्यै','आभ्याम्','आभ्यः'],
             ['अस्याः','आभ्याम्','आभ्यः'],
             ['अस्याः','अनयोः','आसाम्'],
             ['अस्याम्','अनयोः','आसु']]
             
इदम्_neuter=[['इदम्','इमे','इमानि'],
             ['इदम्','इमे','इमानि'],
             ['अनेन','आभ्याम्','एभिः'],
             ['अस्मै','आभ्याम्','एभ्यः'],
             ['अस्मात्','आभ्याम्','एभ्यः'],
             ['अस्य','अनयोः','एषाम्'],
             ['अस्मिन्','अनयोः','एषु']]
             
भवत्_masculine=[['भवान्','भवन्तौ','भवतः'],
             ['भवन्तम्','भवन्तौ','भवतः'],
             ['भवता','भवद्भ्याम्','भवद्भिः'],
             ['भवते','भवद्भ्याम्','भवद्भ्यः'],
             ['भवतः','भवद्भ्याम्','भवद्भ्यः'],
             ['भवतः','भवतोः','भवताम्'],
             ['भवति','भवतोः','भवत्सु']]
             
भवत्_feminine=[['भवती','भवत्यौ','भवत्यः'],
               ['भवतीम्','भवत्यौ','भवतीः'],
               ['भवत्या','भवद्भ्याम्','भवद्भिः'],
               ['भवत्यै','भवद्भ्याम्','भवद्भ्यः'],
               ['भवत्याः','भवद्भ्याम्','भवद्भ्यः'],
               ['भवत्याः','भवत्योः','भवताम्'],
               ['भवत्याम्','भवत्योः','भवत्सु']]
               
भवत्_neuter=[['भवत्','भवती','भवन्ति'],
               ['भवत्','भवती','भवन्ति'],
               ['भवता','भवद्भ्याम्','भवद्भिः'],
               ['भवते','भवद्भ्याम्','भवद्भ्यः'],
               ['भवतः','भवद्भ्याम्','भवद्भ्यः'],
               ['भवतः','भवतोः','भवताम्'],
               ['भवति','भवतोः','भवत्सु']]
               
सर्व_masculine=[['सर्वः','सर्वौ','सर्वे'],
                ['सर्वम्','सर्वौ','सर्वान्'],
                ['सर्वेण','सर्वाभ्य़ाम्','सर्वैः'],
                ['सर्वस्मै','सर्वाभ्य़ाम्','सर्वेभ्यः'],
                ['सर्वस्मात्','सर्वाभ्याम्','सर्वेभ्यः'],
                ['सर्वस्य','सर्वयोः','सर्वेषाम्'],
                ['सर्वस्मिन्','सर्वयोः','सर्वेषु']]
               
सर्व_feminine=[['सर्वा','सर्वे','सर्वाः'],
                ['सर्वाम्','सर्वे','सर्वाः'],
                ['सर्वेया','सर्वाभ्य़ाम्','सर्वाभिः'],
                ['सर्वस्यै','सर्वाभ्य़ाम्','सर्वाभ्यः'],
                ['सर्वस्याः','सर्वाभ्याम्','सर्वाभ्यः'],
                ['सर्वस्याः','सर्वयोः','सर्वासाम्'],
                ['सर्वस्याम्','सर्वयोः','सर्वासु']]  
               
सर्व_neuter=[['सर्वम्','सर्वे','सर्वाणि'],
                ['सर्वम्','सर्वे','सर्वाणि'],
                ['सर्वेण','सर्वाभ्य़ाम्','सर्वैः'],
                ['सर्वस्मै','सर्वाभ्य़ाम्','सर्वेभ्यः'],
                ['सर्वस्मात्','सर्वाभ्याम्','सर्वेभ्यः'],
                ['सर्वस्य','सर्वयोः','सर्वेषाम्'],
                ['सर्वस्मिन्','सर्वयोः','सर्वेषु']]  
      
#all_pronoun=[तत्_masculine,
#             तत्_feminine
#             तत्_neuter,
#             एतत्_masculine,
#             एतत्_feminine,
#             एतत्_neuter ,
#             अस्मद्,
#             युष्मद्,
#             किम्_masculine,
#             किम्_feminine,
#             किम्_neuter,
#             इदम्_masculine,
#             इदम्_feminine,
#             इदम्_neuter ,
#             भवत्_masculine,
#             भवत्_feminine ,
#             भवत्_neuter,
#             सर्व_masculine, 
#             सर्व_feminine,
#             सर्व_neuter]