"""
@author: sourabh garg
Some noun words classied according to their declension type
"""
import itertools
akarant_m=['राम','देव','बाल','बालक','नर','सिंह','जन','गज','अश्व','घट','कूप','भ्रमर',
           'खग','छात्र','सागर','रोष','रन','ज्वर','व्याघ्र','वृक्ष','भ्रम','धीवर','क्रोध','देह',
           'नापित','मूषक','सुत','सर्प']
ekarant_m=['गिरि','हरि','रवि','कवि','अरि','असि','निधि','कपि','पाणि','विधि','अतिथि','भूपति','अग्नि',
           'रश्मि','तिथि','सारथि','अद्रि','पति','कवि','मुनि','सुरपति','नृपति','श्रीपति','महीपति','ऋषि','व्याधि']
ukarant_m=['गुरु','साधु','शिशु','शम्भु','विष्णु','अभिमन्यु','पशु','केतु','सिन्धु','मन्यु','विधु','भानु','सूनु','वायु',
           'प्रभु','जानु','वाहु','सेतु','तरु','इषु','सुधांशु','शुभ्रांशु','ऋतु','इक्षु','शत्रु','तन्तु','बिन्धु','बन्धु']
rikarant_m=['पितृ','कर्तृ','दातृ','भ्रातृ','वक्तृ','पोतृ','भर्तृ','होतृ','नप्तृ','देवृ','जामातृ']
okarant_m=['गो']
aakarant_f=['रमा','बालिका','लता','कमला','सरला','निर्मला','आशा','दुर्गा','विद्या','दया','कृपा',
            'गंगा','कथा','माला','कोकिला','वाटिका','नासिका','प्रभा','शाला','कन्या','कला']
ekarant_f=['मति','भक्ति','बुद्धि','प्रीति','स्तुति','श्रुति','धृति','स्मृति','कीर्ति','कान्ति',
           'जाति','मुक्ति','शक्ति','आकृति','हानि','रीति','भूमि','रूचि','दृष्टि','सृष्टि',
           'संपत्ति','वृद्धि','नीति','शुद्धि','रात्रि','वृष्टि']
eekarant_f=['नदी','काशी','गौरी','पार्वती','लक्ष्मी','काली','भवानी','तरी','तन्त्री','कुमारी',
            'नारी','जननी','नगरी','दासी','पृथ्वी','मैत्री','श्रेणी','पुत्री','धात्री','भागीरथी',
            'स्त्री','श्री','सिंही','वाणी','पत्नी','सखी','देवी','वाराणसी','भगिनी']
ukarant_f=['धेनु','तनु','हनु','रज्जु','रेणु','चञ्चु']
uukarant_f=['वधू','जम्बू','श्मश्रू']
rikarant_f=['मातृ','स्वसृ','दुहितृ','यातृ','ननान्दृ']
ookarant_f=['नौ']
akarant_n=['फल','गृह','नगर','पुस्तक','सुख','खान','नेत्र','मुख','श्रोत्र','चिबुक','उदर','नेपथ्य','कपूर','धन',
           'वन','जल','मित्र','शरीर','वस्त्र','पुष्प','पाप','पुण्य','चक्र','कार्य','पत्र','सत्य','ज्ञान','नवनीत',
           'विष','गीत','कमल','आम्र','मुख']
ekarant_n=['वारि','दधि','अस्थि','अक्षि']
ukarant_n=['मधु','अश्रु','वसु','जानु','वस्तु','दारु','श्यश्रु']
rikarant_n=['कर्तृ','धातृ','ज्ञातृ']

nkarant_m=['राजन्','आत्मन्']
tkarant_m=['भगवत्','भवत्','गतवत्']
skarant_m=['विद्वस्','चन्द्रमस्']
tkarant_f=['सरित्']
ckarant_f=['वाच्']
tkarant_n=['जगत्']
skarant_n=['पयस्']


all_noun=[akarant_m,ekarant_m,ukarant_m,rikarant_m,okarant_m,
          aakarant_f,ekarant_f,eekarant_f,ukarant_f,uukarant_f,rikarant_f,ookarant_f,
          akarant_n,ekarant_n,ukarant_n,rikarant_n,
          nkarant_m,tkarant_m,skarant_m,tkarant_f,ckarant_f,tkarant_n,skarant_n]
all_noun=list(itertools.chain(*all_noun))
