"""
@author: sourabh garg
Some noun words classied according to their declension type
"""
import itertools
a_stem_m=['राम','देव','बाल','बालक','नर','सिंह','जन','गज','अश्व','घट','कूप','भ्रमर',
                  'खग','छात्र','सागर','रोष','रन','ज्वर','व्याघ्र','वृक्ष','भ्रम','धीवर','क्रोध','देह',
                  'नापित','मूषक','सुत','सर्प','ऋक्ष','शूकर','वृक','शृगाल','शशक','वानर',
                  'वृषभ','उष्ट्र','गर्दभ','कुक्कर','मार्जार','अज','प्रासाद','यव','क्षेत्रपालक','मूर्ख','चोर','मोक्ष'
                  'जनक','पुत्र','उपाध्याय','सूर्य','चन्द्र','प्राज्ञ','वर्ण','लोभ','मार्ग','प्रश्न']
i_stem_m=['गिरि','हरि','रवि','कवि','अरि','असि','निधि','कपि','पाणि','विधि','अतिथि','भूपति','अग्नि',
                  'रश्मि','तिथि','सारथि','अद्रि','पति','कवि','मुनि','सुरपति','नृपति','श्रीपति','महीपति','ऋषि','व्याधि','यति']
u_stem_m=['गुरु','साधु','शिशु','शम्भु','विष्णु','अभिमन्यु','पशु','केतु','सिन्धु','मन्यु','विधु','भानु','सूनु','वायु',
                  'प्रभु','जानु','वाहु','सेतु','तरु','इषु','सुधांशु','शुभ्रांशु','ऋतु','इक्षु','शत्रु','तन्तु','बिन्धु','बन्धु','इन्दु','तरु']
r_stem_m_1=['पितृ','भ्रातृ','जामातृ','पोतृ','नप्तृ','देवृ','दुहितृ','नृ']
r_stem_m_2=['कर्तृ','दातृ','वक्तृ','भर्तृ','होतृ','हर्तृ','धर्तृ','श्रोतृ','गन्तृ','द्रष्टृ','नेतृ','भोक्तृ','जेतृ','द्रष्टृ','स्रष्टृ','धातृ','सवितृ']
o_stem_m=['गो','द्यो']
a_stem_f=['रमा','बालिका','लता','कमला','सरला','निर्मला','आशा','दुर्गा','विद्या','दया','कृपा',
                 'गंगा','कथा','माला','कोकिला','वाटिका','नासिका','प्रभा','शाला','कन्या','कला',
                 'अजा','वसुधा','सुधा','लज्जा','प्रजा','शिला','यमुना','क्षमा','निशा','जटा','आज्ञा','सुधा']
i_stem_f=['मति','भक्ति','बुद्धि','प्रीति','स्तुति','श्रुति','धृति','स्मृति','कीर्ति','कान्ति',
                 'जाति','मुक्ति','शक्ति','आकृति','हानि','रीति','भूमि','रूचि','दृष्टि','सृष्टि',
                 'संपत्ति','वृद्धि','नीति','शुद्धि','रात्रि','वृष्टि','गति','कृति','भूति','उक्ति','युक्ति','शान्ति','प्रवृत्ति','प्रणति','समृद्धि','अंगुलि']
ii_stem_f=['नदी','काशी','गौरी','पार्वती','लक्ष्मी','काली','भवानी','तरी','तन्त्री','कुमारी',
                  'नारी','जननी','नगरी','दासी','पृथ्वी','मैत्री','श्रेणी','पुत्री','धात्री','भागीरथी',
                  'स्त्री','श्री','सिंही','वाणी','पत्नी','सखी','देवी','वाराणसी','भगिनी','मही','रजनी','पुरी','सरस्वती','बुद्धिमती','ब्राह्मणी','सर्पिणी',
                  'राज्ञी','श्रीमती','भवती','कौमुदी','कमलिनी','इन्द्राणी']
u_stem_f=['धेनु','तनु','हनु','रज्जु','रेणु','चञ्चु']
uu_stem_f=['वधू','जम्बू','श्मश्रू']
r_stem_f=['मातृ','स्वसृ','दुहितृ','यातृ','ननान्दृ']
oo_stem_f=['नौ']
a_stem_n=['फल','गृह','नगर','पुस्तक','सुख','खान','नेत्र','मुख','श्रोत्र','चिबुक','उदर','नेपथ्य','कपूर','धन',
               'वन','जल','मित्र','शरीर','वस्त्र','पुष्प','पाप','पुण्य','चक्र','कार्य','पत्र','सत्य','ज्ञान','नवनीत',
               'विष','गीत','कमल','आम्र','मुख']
i_stem_n_1=['वारि','शुचि']
i_stem_n_2=['दधि','अस्थि','अक्षि']
u_stem_n=['मधु','अश्रु','वसु','जानु','वस्तु','दारु','श्यश्रु','दारु','अम्बु']
r_stem_n=['कर्तृ','धातृ','ज्ञातृ']
an_stem_m_1=['राजन्','मूर्धन्','तक्षन्']
an_stem_m_2=['आत्मन्']
en_stem_m=['करिन्','पक्षिन्','दण्डिन्','विद्यार्थिन्','स्वामिन्','मन्त्रिन्','ज्ञानिन्','योगिन्','त्यागिन्','धनिन्','पथिन्']
t_stem_m_1=['भगवत्','भवत्','श्रीमत्','बुद्धिमत्','धनवत्','बलवत्','महत्']
t_stem_m_2=['गतवत्','गच्छत्','कुर्वत्','गायत्', 'तिष्ठत्', 'धावत्', 'नृत्यत्', 'पश्यत्', 'पिवत्', 'भवत्', 'गमिष्यत्', 'करिष्यत्', 'हसत्']
t_stem_m_3=['भूभृत्']
s_stem_m=['विद्वस्']
c_stem_m=['पयोमुच्','प्राच्', 'प्रत्यच्', 'उदच्', 'अवाच्', 'तोर्यच्', 'जलमुच्', 'सत्यवाच्']
j_stem_m=['भिषज्','वणिज्']
t_stem_f=['सरित्']
c_stem_f=['वाच्']
sh_stem_f=['दिश्']
h_stem_f=['उपानह्']
dh_stem_f=['क्षुध्']
d_stem_f=['विपद्','मुद्', 'आपद्', 'सम्पद्', 'शरद्', 'परिषद्', 'उपनिषद्']
t_stem_n=['जगत्']
as_stem_n=['पयस्','चेतस्', 'स्रोतस्',  'वचस्', 'अम्भस्', 'वक्षस्','यशस्','शिरस्','सरस्','मनस्','तमस्']
an_stem_n=['नामन्','अहन्','प्रेमन्','व्योमन्','धामन्','लोमन्','कर्मन्','चर्मन्','भस्मन्', 'जन्मन्', 'वेश्मन्', 'शर्मन्', 'वर्मन्']


all_noun=[a_stem_m,i_stem_m,u_stem_m,r_stem_m_1,r_stem_m_2,o_stem_m,
          a_stem_f,i_stem_f,ii_stem_f,u_stem_f,uu_stem_f,r_stem_f,oo_stem_f,
          a_stem_n,i_stem_n_1,i_stem_n_2,u_stem_n,
          en_stem_m,t_stem_m_1,t_stem_m_2,t_stem_m_3,
          an_stem_m_1,an_stem_m_2,c_stem_m,j_stem_m,
          t_stem_f,c_stem_f,h_stem_f,dh_stem_f,d_stem_f,sh_stem_f,
          t_stem_n,as_stem_n,an_stem_n,r_stem_n,s_stem_m]
dict_noun={0:'a_stem_m',
           1:'i_stem_m',
           2:'u_stem_m',
           3:'r_stem_m_1',
           4:'r_stem_m_2',
           5:'o_stem_m',
           6:'a_stem_f',
           7:'i_stem_f',
           8:'ii_stem_f',
           9:'u_stem_f',
           10:'uu_stem_f',
           11:'r_stem_f',
           12:'oo_stem_f',
           13:'a_stem_n',
           14:'i_stem_n_1',
           15:'i_stem_n_2',
           16:'u_stem_n',
           17:'en_stem_m',
           18:'t_stem_m_1',
           19:'t_stem_m_2',
           20:'t_stem_m_3',
           21:'an_stem_m_1',
           22:'an_stem_m_2',
           23:'c_stem_m',
           24:'j_stem_m',
           25:'t_stem_f',
           26:'c_stem_f',
           27:'h_stem_f',
           28:'dh_stem_f',
           29:'d_stem_f',
           30:'sh_stem_f',
           31:'t_stem_n',
           32:'as_stem_n',
           33:'an_stem_n',
           34:'r_stem_n'}
unique=['स्त्री','विद्वस्','पथिन्','सम्राज्']